In [1]:
import pandas as pd

In [13]:
india_weather = pd.DataFrame(
        {"City":["Mumbai","Chandigarh","Pune"],
         "Humidity":[80,50,70],
         "Temperature":[28,22,11]})
india_weather

         City  Humidity  Temperature
0      Mumbai        80           28
1  Chandigarh        50           22
2        Pune        70           11

In [15]:
us_weather = pd.DataFrame(
    {
        "City":["New York","Chicago","Orlando"],
        "Humidity":[68,65,75],
        "Temperature":[21,15,35]
    })
us_weather

       City  Humidity  Temperature
0  New York        68           21
1   Chicago        65           15
2   Orlando        75           35

In [27]:
df = pd.concat([india_weather, us_weather], ignore_index = True )  #ignore_index id used for continues value of table
df

         City  Humidity  Temperature
0      Mumbai        80           28
1  Chandigarh        50           22
2        Pune        70           11
3    New York        68           21
4     Chicago        65           15
5     Orlando        75           35

In [29]:
df = pd.concat([india_weather, us_weather], keys = ["India", "US"] )
df

               City  Humidity  Temperature
India 0      Mumbai        80           28
      1  Chandigarh        50           22
      2        Pune        70           11
US    0    New York        68           21
      1     Chicago        65           15
      2     Orlando        75           35

In [33]:
a,b = df.loc["India"], df.loc["US"]

In [62]:
temperature_df = pd.DataFrame(
    {
        "City":["New York","Chicago","Orlando"],
        "Temperature":[21,15,35]
    }, index = [0,1,2])
temperature_df

       City  Temperature
0  New York           21
1   Chicago           15
2   Orlando           35

In [66]:
windspeed_df = pd.DataFrame(
    {
        "City":["Orlando","New York","Chicago"],
        "Windspeed":[12,8,25]
    }, index = [2,0,1])      # index used for match the index value with another table
windspeed_df

       City  Windspeed
2   Orlando         12
0  New York          8
1   Chicago         25

In [67]:
df = pd.concat([temperature_df, windspeed_df], sort=False, axis=1)

In [68]:
df

       City  Temperature      City  Windspeed
0  New York           21  New York          8
1   Chicago           15   Chicago         25
2   Orlando           35   Orlando         12

In [69]:
temperature_df

       City  Temperature
0  New York           21
1   Chicago           15
2   Orlando           35

In [71]:
pandas_series = pd.Series(["Humidity","Rain","Dry"], name= "Event")

In [78]:
df = pd.concat([temperature_df, pandas_series], axis=1)
df

       City  Temperature     Event
0  New York           21  Humidity
1   Chicago           15      Rain
2   Orlando           35       Dry